## Feature Engineering and Machine Learning

In [1]:
# Imports
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import re
import numpy as np
import xgboost
from sklearn import tree
from sklearn.model_selection import GridSearchCV
from sklearn.model_selection import train_test_split
from xgboost import XGBClassifier
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier

# Figures inline and set visualization style
%matplotlib inline
sns.set()

# Import data
df_train = pd.read_csv('datacamp_facebook_live_titanic/data/train.csv')
df_test = pd.read_csv('datacamp_facebook_live_titanic/data/test.csv')

# Store target variable of training data in a safe place
survived_train = df_train.Survived

# Concatenate training and test sets
data = pd.concat([df_train.drop(['Survived'], axis=1), df_test])

# View head
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Name           1309 non-null object
Sex            1309 non-null object
Age            1046 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Ticket         1309 non-null object
Fare           1308 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

## feature engineering

Consolidate data

In [2]:
# Extract Title from Name, store in column and plot barplot
data['Title'] = data.Name.apply(lambda x: re.search(' ([A-Z][a-z]+)\.', x).group(1))

* Consolidate titles

In [3]:
data['Title'] = data['Title'].replace({'Mlle':'Miss', 'Mme':'Mrs', 'Ms':'Miss'})
data['Title'] = data['Title'].replace(['Don', 'Dona', 'Rev', 'Dr',
                                            'Major', 'Lady', 'Sir', 'Col', 'Capt', 'Countess', 'Jonkheer'],'Special')

In [4]:
# View head of data
data.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,Mr
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,Special
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,Mr
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,Mr
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,Master

### Assess whether cabin or not is important

* There are several NaNs (missing values) in the 'Cabin' column. It is reasonable to presume that those NaNs didn't have a cabin, which may tell us something about 'Survival' so now create a new column that encodes this information:

In [5]:
# Did they have a Cabin?
data['Has_Cabin'] = ~data.Cabin.isnull()

# View head of data
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Has_Cabin
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,False
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,True
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,False
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,True
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,False

In [6]:
# Drop columns and view head
data.drop(['Cabin', 'Name', 'PassengerId', 'Ticket'], axis=1, inplace=True)
data.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked Title  Has_Cabin
0       3    male  22.0      1      0   7.2500        S    Mr      False
1       1  female  38.0      1      0  71.2833        C   Mrs       True
2       3  female  26.0      0      0   7.9250        S  Miss      False
3       1  female  35.0      1      0  53.1000        S   Mrs       True
4       3    male  35.0      0      0   8.0500        S    Mr      False

### Dealing with missing values

* Figure out if there are any missing values left:

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 9 columns):
Pclass       1309 non-null int64
Sex          1309 non-null object
Age          1046 non-null float64
SibSp        1309 non-null int64
Parch        1309 non-null int64
Fare         1308 non-null float64
Embarked     1307 non-null object
Title        1309 non-null object
Has_Cabin    1309 non-null bool
dtypes: bool(1), float64(2), int64(3), object(3)
memory usage: 93.3+ KB

* Impute missing values:

In [8]:
# Impute missing values for Age, Fare, Embarked
data['Age'] = data.Age.fillna(data.Age.median())
data['Fare'] = data.Fare.fillna(data.Fare.median())
data['Embarked'] = data['Embarked'].fillna('S')
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 9 columns):
Pclass       1309 non-null int64
Sex          1309 non-null object
Age          1309 non-null float64
SibSp        1309 non-null int64
Parch        1309 non-null int64
Fare         1309 non-null float64
Embarked     1309 non-null object
Title        1309 non-null object
Has_Cabin    1309 non-null bool
dtypes: bool(1), float64(2), int64(3), object(3)
memory usage: 93.3+ KB

In [9]:
data.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked Title  Has_Cabin
0       3    male  22.0      1      0   7.2500        S    Mr      False
1       1  female  38.0      1      0  71.2833        C   Mrs       True
2       3  female  26.0      0      0   7.9250        S  Miss      False
3       1  female  35.0      1      0  53.1000        S   Mrs       True
4       3    male  35.0      0      0   8.0500        S    Mr      False

### Bin numerical data

* Use the `pandas` function `qcut` to bin your numerical data:

In [10]:
# Binning numerical columns
data['CatAge'] = pd.qcut(data.Age, q=4, labels=False )
data['CatFare']= pd.qcut(data.Fare, q=4, labels=False)
data.head()

,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,Has_Cabin,CatAge,CatFare
0,3,male,22.0,1,0,7.2500,S,Mr,False,0,0
1,1,female,38.0,1,0,71.2833,C,Mrs,True,3,3
2,3,female,26.0,0,0,7.9250,S,Miss,False,1,1
3,1,female,35.0,1,0,53.1000,S,Mrs,True,2,3
4,3,male,35.0,0,0,8.0500,S,Mr,False,2,1

* Drop 'Age' and 'Fare' columns:

In [11]:
data = data.drop(['Age', 'Fare'], axis=1)
data.head()

   Pclass     Sex  SibSp  Parch Embarked Title  Has_Cabin  CatAge  CatFare
0       3    male      1      0        S    Mr      False       0        0
1       1  female      1      0        C   Mrs       True       3        3
2       3  female      0      0        S  Miss      False       1        1
3       1  female      1      0        S   Mrs       True       2        3
4       3    male      0      0        S    Mr      False       2        1

## Create a new column: number of members in family onboard

In [12]:
# Create column of number of Family members onboard
data['Fam_Size'] = 0

In [13]:
# Drop columns
data = data.drop(['SibSp','Parch'], axis=1)
data.head()

   Pclass     Sex Embarked Title  Has_Cabin  CatAge  CatFare  Fam_Size
0       3    male        S    Mr      False       0        0         0
1       1  female        C   Mrs       True       3        3         0
2       3  female        S  Miss      False       1        1         0
3       1  female        S   Mrs       True       2        3         0
4       3    male        S    Mr      False       2        1         0

## Transform all variables into numerical variables

In [14]:
# Transform into binary variables
data_dum = pd.get_dummies(data, drop_first=True)
data_dum.head()

,Pclass,Has_Cabin,CatAge,CatFare,Fam_Size,Sex_male,Embarked_Q,Embarked_S,Title_Miss,Title_Mr,Title_Mrs,Title_Special
0,3,False,0,0,0,1,0,1,0,1,0,0
1,1,True,3,3,0,0,0,0,0,0,1,0
2,3,False,1,1,0,0,0,1,1,0,0,0
3,1,True,2,3,0,0,0,1,0,0,1,0
4,3,False,2,1,0,1,0,1,0,1,0,0

## Modelling: Decision Tree

* Training and test sets:

In [15]:
# Split into test.train
data_train = data_dum.iloc[:891]
data_test = data_dum.iloc[891:]

# Transform into arrays for scikit-learn
X = data_train.values
test = data_test.values
y = survived_train.values

Build a decision tree. Using 5 fold cross validation to select best max depth using GridSearch.

In [16]:
# Setup the hyperparameter grid
dep = np.arange(1,9)
param_grid = {'max_depth' : dep}

# Instantiate a decision tree classifier: clf
clf = tree.DecisionTreeClassifier()

# Instantiate the GridSearchCV object: clf_cv
clf_cv = GridSearchCV(clf, param_grid=param_grid, cv=5,
                     scoring = 'roc_auc')

# Fit it to the data
clf_cv.fit(X, y)

# Print the tuned parameter and score
print("Tuned Decision Tree Parameters: {}".format(clf_cv.best_params_))
print("Best score is {}".format(clf_cv.best_score_))

Tuned Decision Tree Parameters: {'max_depth': 4}
Best score is 0.853483917984185

In [17]:
Y_pred = clf_cv.predict(test)
df_test['Survived'] = Y_pred
df_test[['PassengerId', 'Survived']].to_csv('datacamp_facebook_live_titanic/data/predictions/dec_tree_feat_eng.3.csv', 
                                            index=False)
data_train.head()

,Pclass,Has_Cabin,CatAge,CatFare,Fam_Size,Sex_male,Embarked_Q,Embarked_S,Title_Miss,Title_Mr,Title_Mrs,Title_Special
0,3,False,0,0,0,1,0,1,0,1,0,0
1,1,True,3,3,0,0,0,0,0,0,1,0
2,3,False,1,1,0,0,0,1,1,0,0,0
3,1,True,2,3,0,0,0,1,0,0,1,0
4,3,False,2,1,0,1,0,1,0,1,0,0

* What was the accuracy?

_Accuracy_ = 78.9.

## Modelling: RandomForestClassifier

Run a random classifier, to increase accuracy

In [33]:
pred_column = 'Survived'

X_train, X_test, y_train, y_test = train_test_split(data_train, y, test_size=0.2, random_state=1234)

# Set up and train classifier
model = RandomForestClassifier(n_estimators=100)

model.fit(X_train, y_train)

#model.fit(X_train, y_train, eval_set=[(X_train, y_train), (X_test, y_test)], early_stopping_rounds=10, verbose=True)

score = model.score(X_test, y_test)
# evaluate predictions
print("RandomForest Classifier accuracy:"+str(score))

Y_pred = model.predict(test)
len(Y_pred)

df_test['Survived'] = Y_pred
df_test[['PassengerId', 'Survived']].to_csv('rf_class.kaggle.csv', 
                                            index=False)

# y_test
#model.fit(X_train, y_train, eval_set=[(X_train, y_train), (X_test, y_test)], early_stopping_rounds=10, verbose=True)
#model.score(X_test, y_test)

RandomForest Classifier accuracy:0.8100558659217877